package _05_Class._03_Static;

// 정적 (static) 멤버
// - 객체를 생성할 필요 없이 클래스 통해서 바로 접근 가능
// 클래스가 메모리에 로딩되면 정적 멤버는 바로 사용 가능
// - 클래스 이름과 함께 (.) 연산자로 사용 가능
// - 정적 메서드 정적 블록은 객체가 없어도 사용이 가능 => 내부에 인스턴스 필드나 인스턴스 메소드 사용 불가능!
// - 객체 자신의 참조인 this 도 사용 불가! -> static 은 객체를 만들기 전에 사용하는 거라 non-static 객체 에 접근힐 수 없다.

// 참고)
// 정적 필드는 객체 생성 없이도 사용 가능하므로 생성자에서 초기화 작업을 하지 않음
// => 생성자는 객체를 생성 후에 실행되기 때문에 초기화를 해주지 않는다.


public class Calculator {
    // 정적 필드
    static double pi = 3.141592; // 어떤 계산기든 파이 값은 항상 동일하므로 static 으로 선언 가능

    // 정적 메소드
    // plus, minus 외부에서 주어진 값으로 처리하므로 정적 메서드로 처리하는 것이 유리
    // : 메소드의 매개변수가 인스턴스 필드를 이용하지 않으므로
    static int plus(int x, int y){
        return x + y;
    }

    static int minus(int x, int y){
        return x - y;
    }

}
